app/controllers/interacao_controller.rb

SELECT * FROM `ilustracoes`
---
  def ilustracoes
  	@titulo = "Ilustrações de Paz e Vida"
  	@ilustracoes = Ilustracoes.all

INSERT INTO `pedido_oracao` (`created_at`, `nome`, `updated_at`, `pedido`, `email`) VALUES('2010-01-22 15:01:08', 'Allyson Barros', '2010-01-22 15:01:08', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi nunc arcu, suscipit nec sodales ornare, imperdiet et enim. Fusce euismod, arcu non elementum mattis, nisi urna euismod mauris, vitae aliquet risus purus ut lorem. Aliquam erat volutpat. Aliquam erat volutpat. Donec tempor sodales erat, sit amet facilisis neque gravida vel. Praesent id ipsum et augue dignissim varius quis ac libero. Suspendisse quis erat vel turpis fringilla commodo et sed lorem. Donec placerat tristique nisl dictum ullamcorper. Cras sodales ornare convallis. Morbi libero neque, viverra eget viverra at, consequat eu orci. Nam porttitor molestie lorem sit amet laoreet. Nulla facilisi. Maecenas sagittis commodo magna, sit amet aliquam augue iaculis eu.', 'allysonbarrorn@gmail.com')
---
  def cadastrar_pedido_oracao
  	@pedido = PedidoOracao.new(params[:pedido_oracao])
  	if @pedido.save

SELECT * FROM `textos_biblicos` WHERE (SEQUENCIAL = 79)
---
  def textos_biblicos
  	@titulo = "Textos Bíblicos"
  	@texto_biblico = TextosBiblicos.all.rand();