app/controllers/player_controller.rb

  def ilustracoes
  	@ilustracao = Ilustracoes.find(params[:id])
---
SELECT * FROM `ilustracoes` WHERE (`ilustracoes`.`id` = 1)