app/controllers/principal_controller.rb

INSERT INTO `mala_direta` (`created_at`, `nome`, `updated_at`, `email`) VALUES('2010-01-21 13:14:45', NULL, '2010-01-21 13:14:45', NULL)
---
  def create
  	@newsletter = MalaDireta.new(params[:mala_direta])

  	if @newsletter.save